cse_6250_bd4h/index.org
#+AUTHOR: W
#+SETUPFILE:/Users/whkoh/git-repos/org-html-themes/org/theme-readtheorg-local-parent.setup
#+TITLE: BD4H
* Introduction to Big Data
** Introduction
   - Course: Big Data Analytics for Healthcare (BDAH)
   - Instructor: Jimeng Sun, associate professor at Georgia Tech
   - Background: Expertise in healthcare analytics and data mining, previous work at IBM TJ Watson Research Center
   - Course focus: What students will learn and why it matters

