cse_6250_bd4h/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-29 Sat 11:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BD4H</title>
<meta name="author" content="W" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">BD4H</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org49dcc2c">1. Introduction to Big Data</a>
<ul>
<li><a href="#org8ce63f5">1.1. Introduction</a></li>
<li><a href="#org50bd475">1.2. About BDAH</a></li>
<li><a href="#org6d26834">1.3. Learning Goals</a></li>
<li><a href="#org3d326ea">1.4. Current Problems in Healthcare</a></li>
<li><a href="#orgdad47c6">1.5. The Four Vs</a></li>
<li><a href="#org18cd480">1.6. More About The Four Vs</a></li>
<li><a href="#org914b7f8">1.7. Data Science is Sexy</a></li>
<li><a href="#org442ef44">1.8. BDAH Quiz 1 Question</a></li>
<li><a href="#orgec393ad">1.9. BDAH Quiz 1 Solution</a></li>
<li><a href="#org70e5703">1.10. BDAH Quiz 2 Question</a></li>
<li><a href="#orga34e5a5">1.11. BDAH Quiz 2 Solution</a></li>
<li><a href="#orgeb491e2">1.12. BDAH Quiz 3 Question</a></li>
<li><a href="#orgc697b9a">1.13. BDAH Quiz 3 Solution</a></li>
</ul>
</li>
<li><a href="#org9078066">2. Big Data Course Overview</a>
<ul>
<li><a href="#orgffe7c78">2.1. Introduction to Course Overview</a></li>
<li><a href="#orgcb17cca">2.2. Big Data Big Picture</a></li>
<li><a href="#org5cbaa53">2.3. Healthcare Applications</a></li>
<li><a href="#orgfeab61f">2.4. Predictive Modeling Quiz Question</a></li>
<li><a href="#orgb1b3724">2.5. Predictive Modeling Quiz Solution</a></li>
<li><a href="#orgc367490">2.6. Predictive Modeling Challenges</a></li>
<li><a href="#org0129c56">2.7. Computational Phenotyping</a></li>
<li><a href="#org25b8916">2.8. Computational Phenotyping Quiz Question</a></li>
<li><a href="#orgae0f959">2.9. Computational Phenotyping Quiz Solution</a></li>
<li><a href="#orgc90cfe8">2.10. Phenotyping Algorithm</a></li>
<li><a href="#org5697b63">2.11. Patient Similarity Quiz Question</a></li>
<li><a href="#org63ef72b">2.12. Patient Similarity Quiz Solution</a></li>
<li><a href="#orgba03a50">2.13. Patient Similarity</a></li>
<li><a href="#orgdaf0e84">2.14. Algorithms</a></li>
<li><a href="#orgfbbb5b7">2.15. Systems</a></li>
<li><a href="#org91d83d1">2.16. Summary</a></li>
</ul>
</li>
<li><a href="#org97426b2">3. Predictive Modeling</a>
<ul>
<li><a href="#org8f3ae3a">3.1. Introduction to Predictive Modeling</a></li>
<li><a href="#org31efd89">3.2. Predictive Modeling vs EHR</a></li>
<li><a href="#org36a6d71">3.3. Predictive Modeling Pipeline</a></li>
<li><a href="#orgcf5144f">3.4. Prediction Target</a></li>
<li><a href="#org6858598">3.5. Heart Failure Quiz</a></li>
<li><a href="#orge55a933">3.6. Motivations for Early Detection</a></li>
<li><a href="#org482e020">3.7. Cohort Construction</a></li>
<li><a href="#org6d13499">3.8. Prospective vs. Retrospective Studies</a></li>
<li><a href="#org7576808">3.9. Prospective vs. Retrospective Quiz</a></li>
<li><a href="#orgd9d575e">3.10. Cohort Study</a></li>
<li><a href="#orgf7623e9">3.11. Case-Control Study</a></li>
<li><a href="#org9ce129b">3.12. Feature Construction</a></li>
<li><a href="#org38c1afc">3.13. Feature Construction Quizzes</a></li>
<li><a href="#org7badafb">3.14. Prediction Performance on Windows</a></li>
<li><a href="#org459ec0d">3.15. Feature Selection</a></li>
<li><a href="#org02c4c49">3.16. Predictive Model</a></li>
<li><a href="#orgd97c564">3.17. Performance Evaluation</a></li>
<li><a href="#org4680617">3.18. Cross-Validation</a></li>
<li><a href="#org70c4643">3.19. Conclusion</a></li>
</ul>
</li>
<li><a href="#org701ab65">4. MapReduce</a>
<ul>
<li><a href="#orgfc1d2d2">4.1. Introduction to MapReduce</a></li>
<li><a href="#org6464203">4.2. What is MapReduce</a></li>
<li><a href="#orgaaa26da">4.3. Computational Process</a></li>
<li><a href="#org0555299">4.4. Learning Via Aggregation Statistics</a></li>
<li><a href="#orgfc767d4">4.5. MapReduce Abstraction</a></li>
<li><a href="#org231367f">4.6. MapReduce System</a></li>
<li><a href="#orgcbab645">4.7. MapReduce Fault Recovery</a></li>
<li><a href="#orgef42e83">4.8. Distributed File Systems</a></li>
<li><a href="#orgf4da16f">4.9. MapReduce Design Choice</a></li>
<li><a href="#org7e5e46d">4.10. Analytics with MapReduce</a></li>
<li><a href="#org681ce3a">4.11. MapReduce KNN</a></li>
<li><a href="#org2267f49">4.12. Linear Regression</a></li>
<li><a href="#org18bfa1a">4.13. MapReduce for Linear Regression Quiz Question</a></li>
<li><a href="#org4ce1800">4.14. MapReduce for Linear Regression Quiz Solution</a></li>
<li><a href="#orge05a5ab">4.15. Limitations of MapReduce</a></li>
<li><a href="#orga0e4c13">4.16. MapReduce Summary Quiz Question</a></li>
<li><a href="#orgba8ce3e">4.17. MapReduce Summary Quiz Solution</a></li>
</ul>
</li>
<li><a href="#orgf5c35b5">5. Classification Model Metrics</a>
<ul>
<li><a href="#org0e8e482">5.1. Predictive Model review</a></li>
<li><a href="#org106ebbe">5.2. Confusion matrix</a></li>
<li><a href="#orgac80b3e">5.3. Accuracy metrics</a>
<ul>
<li><a href="#org7f05500">5.3.1. Other notes</a></li>
</ul>
</li>
<li><a href="#orgde641da">5.4. Predictive metrics</a></li>
<li><a href="#org1b9601d">5.5. F1 score</a></li>
<li><a href="#org14aa8dc">5.6. Classifier quiz</a></li>
<li><a href="#orgb0eb435">5.7. Reversing predictions</a></li>
<li><a href="#org2fee4f4">5.8. Receiver operating characteristic</a></li>
<li><a href="#orgab42907">5.9. "Best classifier threshold" quiz</a></li>
<li><a href="#org458ad2b">5.10. Regression metrics</a>
<ul>
<li><a href="#orgdf6d8b2">5.10.1. \(R^2\)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org999b6a0">6. Ensemble methods</a>
<ul>
<li><a href="#orgcbfd2fc">6.1. Gradient Descent Method (GDM) for Linear Regression</a></li>
<li><a href="#org67a6156">6.2. Stochastic Gradient Descent (SGD) Method</a></li>
<li><a href="#orgc193ce9">6.3. SGD for Linear Regression</a></li>
<li><a href="#orga4f796e">6.4. Ensemble Method Pt 1</a></li>
<li><a href="#orgcdd5783">6.5. Ensemble Method Pt 2</a></li>
<li><a href="#org81600c3">6.6. Bias Variance Tradeoff</a></li>
<li><a href="#org919109f">6.7. Bias Variance Tradeoff Quiz Question</a></li>
<li><a href="#org2110929">6.8. Bias Variance Tradeoff Quiz Solution</a></li>
<li><a href="#org20922b4">6.9. Bias Variance Tradeoff Quiz 2 Question</a></li>
<li><a href="#org6153c61">6.10. Bias Variance Tradeoff Quiz 2 Solution</a></li>
<li><a href="#orgd2497dd">6.11. Bagging</a></li>
<li><a href="#org21589c6">6.12. Random Forest</a></li>
<li><a href="#org8773336">6.13. Why Bagging Works</a></li>
<li><a href="#orge8a5de2">6.14. Boosting</a></li>
<li><a href="#org7d2bd59">6.15. Bagging vs Boosting Quiz Question</a></li>
<li><a href="#orgecaa133">6.16. Bagging vs Boosting Quiz Solution</a></li>
<li><a href="#orgebbb8b5">6.17. Summary for Ensemble Methods</a></li>
<li><a href="#org85f9503">6.18. Introduction to Ensemble Method</a></li>
<li><a href="#org6271f1c">6.19. Gradient Descent Method</a></li>
</ul>
</li>
<li><a href="#orgb656877">7. Computational Phenotyping</a>
<ul>
<li><a href="#org0313bbb">7.1. Introduction to Phenotyping</a></li>
<li><a href="#orgdc9bd14">7.2. Computational Phenotyping</a></li>
<li><a href="#org2791a9d">7.3. Phenotyping Algorithm</a></li>
<li><a href="#org54a6825">7.4. Applications of Phenotyping</a></li>
<li><a href="#org266ecf6">7.5. Genomic Wide Association Study</a></li>
<li><a href="#orgd1b8bd0">7.6. Why Do We Care About Phenotyping</a></li>
<li><a href="#orgb9fecf8">7.7. Clinical Predictive Modeling</a></li>
<li><a href="#org36f09c7">7.8. Pragmatic Clinical Trials</a></li>
<li><a href="#org4363c86">7.9. Healthcare Quality Measurement</a></li>
<li><a href="#org28726c3">7.10. Phenotyping Methods Part 1</a></li>
<li><a href="#org48be3f6">7.11. Phenotyping Methods Part 2</a></li>
<li><a href="#orgec09b68">7.12. Phenotyping Quiz Question</a></li>
<li><a href="#org822c87d">7.13. Phenotyping Quiz Solution</a></li>
</ul>
</li>
<li><a href="#orgec62c37">8. Clustering</a>
<ul>
<li><a href="#org40fbb9b">8.1. Introduction to Clustering</a></li>
<li><a href="#org101613b">8.2. Healthcare Applications</a></li>
<li><a href="#org045b51b">8.3. What is Clustering</a></li>
<li><a href="#orgffe57bc">8.4. Algorithm Overview</a></li>
<li><a href="#orgf872e0c">8.5. K Means</a></li>
<li><a href="#org61ea298">8.6. K Means Quiz Question</a></li>
<li><a href="#org3723902">8.7. K Means Quiz Solution</a></li>
<li><a href="#org339dbbb">8.8. Hierarchical Clustering</a></li>
<li><a href="#orge3c3cda">8.9. Agglomerative Clustering</a></li>
<li><a href="#org1c61285">8.10. Gaussian Mixture Model</a></li>
<li><a href="#orged05ea6">8.11. GMM Expectation Maximization</a></li>
<li><a href="#org0d66189">8.12. GMM Steps</a></li>
<li><a href="#org39aeaea">8.13. GMM Visual Illustration</a></li>
<li><a href="#org37b9f64">8.14. K Means Vs GMM</a></li>
<li><a href="#org4f5805e">8.15. Mini Batch K Means</a></li>
<li><a href="#orgd5230f1">8.16. Mini Batch K Means Quiz Question</a></li>
<li><a href="#orgdca7329">8.17. Mini Batch K Means Quiz Solution</a></li>
<li><a href="#org7dbc599">8.18. DBScan</a></li>
<li><a href="#org40a3bf8">8.19. DBScan Key Concepts</a></li>
<li><a href="#org4a4f385">8.20. DBScan Algorithm</a></li>
<li><a href="#org8220405">8.21. DBScan Example</a></li>
<li><a href="#org73e4ac8">8.22. DBScan Quiz Question</a></li>
<li><a href="#org56d79ef">8.23. DBScan Quiz Solution</a></li>
<li><a href="#org9c0eac3">8.24. Clustering Evaluation Metrics</a></li>
<li><a href="#orga807598">8.25. Rand Index</a></li>
<li><a href="#org4a93cc8">8.26. Mutual Information</a></li>
<li><a href="#orgbd2fb8b">8.27. Summary of RI and MI</a></li>
<li><a href="#org9bf4756">8.28. Silhouette Coefficient</a></li>
<li><a href="#orge5cf134">8.29. Silhouette Coefficient Pros and Cons</a></li>
</ul>
</li>
<li><a href="#org6d3d943">9. Spark</a>
<ul>
<li><a href="#org12d4729">9.1. Introduction to Spark</a></li>
<li><a href="#orgf171f08">9.2. Environment</a></li>
<li><a href="#org5b6a6d9">9.3. Motivation</a></li>
<li><a href="#orgcae4a04">9.4. Iteration in Map Reduce</a></li>
<li><a href="#org0aec3fb">9.5. Workload Illustration</a></li>
<li><a href="#org1250ef7">9.6. Challenge</a></li>
<li><a href="#orgf205d96">9.7. Solution  RDDs</a></li>
<li><a href="#orge0c62c2">9.8. RDD Recovery</a></li>
<li><a href="#orgc185e54">9.9. Spark Stack</a></li>
<li><a href="#org4366103">9.10. Spark Programming Interface</a></li>
<li><a href="#org2c4a9c2">9.11. RDD Transformations</a></li>
<li><a href="#org5782b85">9.12. RDD Transformations Quiz Question</a></li>
<li><a href="#orgc7a4d38">9.13. RDD Transformations Quiz Solution</a></li>
<li><a href="#org1285c3e">9.14. Spark Operations</a></li>
<li><a href="#org382f04c">9.15. Shared Variable</a></li>
<li><a href="#org4ab58ee">9.16. Fault Tolerance</a></li>
<li><a href="#org9bd8456">9.17. Example  Logistic Regression</a></li>
<li><a href="#org88ba6d5">9.18. Example  Disease Risk Prediction</a></li>
<li><a href="#orgb38387d">9.19. Serial ALS</a></li>
<li><a href="#org03c667b">9.20. Naive Spark ALS</a></li>
</ul>
</li>
<li><a href="#orgf308ff8">10. Medical Ontology</a>
<ul>
<li><a href="#org6767589">10.1. Introduction to Medical Ontology</a></li>
<li><a href="#org10830be">10.2. Health Data Standards</a></li>
<li><a href="#orgbdf5a44">10.3. ICD</a></li>
<li><a href="#orga1cd6c5">10.4. ICD 9 to ICD 10 Mapping</a></li>
<li><a href="#org18841f2">10.5. ICD 9 Quiz Question</a></li>
<li><a href="#orge9b5185">10.6. ICD 9 Quiz Solution</a></li>
<li><a href="#org26cb049">10.7. ICD Code Quiz Question</a></li>
<li><a href="#org5715647">10.8. ICD Code Quiz Solution</a></li>
<li><a href="#org45056e9">10.9. CPT</a></li>
<li><a href="#org517c583">10.10. CPT Code Quiz Question</a></li>
<li><a href="#orgb5f34c0">10.11. CPT Code Quiz Solution</a></li>
<li><a href="#org09e81eb">10.12. LOINC</a></li>
<li><a href="#orgf2b265d">10.13. LOINC Code Quiz Question</a></li>
<li><a href="#org0e65069">10.14. LOINC Code Quiz Solution</a></li>
<li><a href="#org359b111">10.15. NDC</a></li>
<li><a href="#org275d45d">10.16. NDC Code Quiz Question</a></li>
<li><a href="#org76ec4ac">10.17. NDC Code Quiz Solution</a></li>
<li><a href="#org79096a7">10.18. SNOMED</a></li>
<li><a href="#orgc142776">10.19. Logical Model of SNOMED CT</a></li>
<li><a href="#org313882d">10.20. SNOMED Example</a></li>
<li><a href="#org095bae4">10.21. SNOMED Relationships</a></li>
<li><a href="#org65fd78d">10.22. SNOMED Design</a></li>
<li><a href="#org236643e">10.23. SNOMED Code Quiz Question</a></li>
<li><a href="#orgc343de9">10.24. SNOMED Code Quiz Solution</a></li>
<li><a href="#org90f70eb">10.25. SNOMED Quiz Question</a></li>
<li><a href="#orge5149a1">10.26. SNOMED Quiz Solution</a></li>
<li><a href="#org5a5300e">10.27. UMLS</a></li>
<li><a href="#orgb12b516">10.28. Metathesaurus Concepts</a></li>
<li><a href="#org8a63346">10.29. Semantic Network</a></li>
<li><a href="#orgfe3e3af">10.30. Specialist Lexicon</a></li>
</ul>
</li>
<li><a href="#org3383461">11. Graph Analysis</a>
<ul>
<li><a href="#org17d40f3">11.1. Introduction to Graph Analysis</a></li>
<li><a href="#org540bd8e">11.2. Agenda</a></li>
<li><a href="#org8b76b8f">11.3. PageRank</a></li>
<li><a href="#org7d0699e">11.4. MapReduce  PageRank</a></li>
<li><a href="#orgda0012c">11.5. PageRank Quiz Question</a></li>
<li><a href="#org4731d49">11.6. PageRank Quiz Solution</a></li>
<li><a href="#orgd751a04">11.7. Spectral Clustering</a></li>
<li><a href="#org469a04b">11.8. Similarity Graph Construction</a></li>
<li><a href="#org43688db">11.9. E Neighborhood Graph</a></li>
<li><a href="#org0f498ed">11.10. K Nearest Neighbor Graph</a></li>
<li><a href="#org58e1cb4">11.11. Fully Connected Graph</a></li>
<li><a href="#org8faa972">11.12. E Neighborhood Graph Quiz Question</a></li>
<li><a href="#orgfd5c68b">11.13. E Neighborhood Graph Quiz Solution</a></li>
<li><a href="#orgb4d1afb">11.14. Spectral Clustering Algorithm</a></li>
<li><a href="#orgec615dc">11.15. Big Data Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org49dcc2c" class="outline-2">
<h2 id="org49dcc2c"><span class="section-number-2">1.</span> Introduction to Big Data</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8ce63f5" class="outline-3">
<h3 id="org8ce63f5"><span class="section-number-3">1.1.</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Course: Big Data Analytics for Healthcare (BDAH)</li>
<li>Instructor: Jimeng Sun, associate professor at Georgia Tech</li>
<li>Background: Expertise in healthcare analytics and data mining, previous work at IBM TJ Watson Research Center</li>
<li>Course focus: What students will learn and why it matters</li>
</ul>
</div>
</div>
