cse_6250_bd4h/index.html

<div id="outline-container-orgdca7329" class="outline-3">
<h3 id="orgdca7329"><span class="section-number-3">8.17.</span> Mini Batch K Means Quiz Solution</h3>
<div class="outline-text-3" id="text-8-17">
<ul class="org-ul">
<li>Complexity: O(t × b × k × d)</li>
</ul>
</div>
</div>

<div id="outline-container-org7dbc599" class="outline-3">
<h3 id="org7dbc599"><span class="section-number-3">8.18.</span> DBScan</h3>
<div class="outline-text-3" id="text-8-18">
<ul class="org-ul">
<li>Density-Based Spatial Clustering.</li>
<li>Clusters = dense areas, separated by sparse regions.</li>
<li>Can identify clusters of arbitrary shape.</li>
<li>Effective for noisy data.</li>
</ul>
</div>
</div>

<div id="outline-container-org40a3bf8" class="outline-3">
<h3 id="org40a3bf8"><span class="section-number-3">8.19.</span> DBScan Key Concepts</h3>
<div class="outline-text-3" id="text-8-19">
<ul class="org-ul">
<li>Density = number of points within ε-distance.</li>
<li>Key concepts:
<ul class="org-ul">
<li>Core points: high-density.</li>
<li>Border points: near core points.</li>
<li>Noise: not in dense region.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4a4f385" class="outline-3">
<h3 id="org4a4f385"><span class="section-number-3">8.20.</span> DBScan Algorithm</h3>
<div class="outline-text-3" id="text-8-20">
<ul class="org-ul">
<li>Steps:
<ol class="org-ol">
<li>Build graph connecting core points to neighbors.</li>
<li>Identify connected components as clusters.</li>
<li>Remove clustered points and repeat.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org8220405" class="outline-3">
<h3 id="org8220405"><span class="section-number-3">8.21.</span> DBScan Example</h3>
<div class="outline-text-3" id="text-8-21">
<ul class="org-ul">
<li>Visual example: finds 6 clusters, some noise points remain.</li>
</ul>
</div>
</div>

<div id="outline-container-org73e4ac8" class="outline-3">
<h3 id="org73e4ac8"><span class="section-number-3">8.22.</span> DBScan Quiz Question</h3>
<div class="outline-text-3" id="text-8-22">
<ul class="org-ul">
<li>Quiz: How many clusters can a point belong to in DBSCAN?</li>
</ul>
</div>
</div>

<div id="outline-container-org56d79ef" class="outline-3">
<h3 id="org56d79ef"><span class="section-number-3">8.23.</span> DBScan Quiz Solution</h3>
<div class="outline-text-3" id="text-8-23">
<ul class="org-ul">
<li>Answer: 0 or 1 (noise = 0, core/border = 1)</li>
</ul>
</div>
</div>

<div id="outline-container-org9c0eac3" class="outline-3">
<h3 id="org9c0eac3"><span class="section-number-3">8.24.</span> Clustering Evaluation Metrics</h3>
<div class="outline-text-3" id="text-8-24">
<ul class="org-ul">
<li>Metrics:
<ul class="org-ul">
<li>Rand Index (RI)</li>
<li>Mutual Information (MI)</li>
<li>Silhouette Coefficient</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga807598" class="outline-3">
<h3 id="orga807598"><span class="section-number-3">8.25.</span> Rand Index</h3>
<div class="outline-text-3" id="text-8-25">
<ul class="org-ul">
<li>Measures agreement between predicted and true clusters.</li>
<li>RI = (number of correct pairs) / (total pairs)</li>
<li>Value between 0 (bad) and 1 (perfect).</li>
</ul>
</div>
</div>

<div id="outline-container-org4a93cc8" class="outline-3">
<h3 id="org4a93cc8"><span class="section-number-3">8.26.</span> Mutual Information</h3>
<div class="outline-text-3" id="text-8-26">
<ul class="org-ul">
<li>From information theory: measures shared info between predicted and true clusters.</li>
<li>Normalized Mutual Information (NMI) between 0 and 1.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd2fb8b" class="outline-3">
<h3 id="orgbd2fb8b"><span class="section-number-3">8.27.</span> Summary of RI and MI</h3>
<div class="outline-text-3" id="text-8-27">
<ul class="org-ul">
<li>Pros:
<ul class="org-ul">
<li>Bounded values, interpretable.</li>
<li>No assumptions about cluster shapes.</li>
</ul></li>
<li>Cons:
<ul class="org-ul">
<li>Require ground truth, which may be unavailable.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9bf4756" class="outline-3">
<h3 id="org9bf4756"><span class="section-number-3">8.28.</span> Silhouette Coefficient</h3>
<div class="outline-text-3" id="text-8-28">
<ul class="org-ul">
<li>Measures how similar a point is to its own cluster vs. others.</li>
<li>Formula: (b - a) / max(a, b)</li>
<li>Does not require ground truth.</li>
</ul>
</div>
</div>

<div id="outline-container-orge5cf134" class="outline-3">
<h3 id="orge5cf134"><span class="section-number-3">8.29.</span> Silhouette Coefficient Pros and Cons</h3>
<div class="outline-text-3" id="text-8-29">
<ul class="org-ul">
<li>Range: -1 (bad) to 1 (good), 0 = overlapping clusters.</li>
<li>Assumes spherical clusters → less effective for complex shapes (e.g. DBSCAN).</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org6d3d943" class="outline-2">
<h2 id="org6d3d943"><span class="section-number-2">9.</span> Spark</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org12d4729" class="outline-3">
<h3 id="org12d4729"><span class="section-number-3">9.1.</span> Introduction to Spark</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Spark is introduced as an alternative to MapReduce, better suited for iterative workloads.</li>
<li>Leverages distributed memory across machines.</li>
<li>Core concept: Resilient Distributed Dataset (RDD).</li>
<li>Promotes efficiency for machine learning and healthcare applications.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf171f08" class="outline-3">
<h3 id="orgf171f08"><span class="section-number-3">9.2.</span> Environment</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Big data analytics typically run in data centers or cloud platforms like AWS, GCP, Azure.</li>
<li>Environment includes interconnected racks of servers.</li>
<li>Context set to understand the need for systems like Spark.</li>
</ul>
</div>
</div>

<div id="outline-container-org5b6a6d9" class="outline-3">
<h3 id="org5b6a6d9"><span class="section-number-3">9.3.</span> Motivation</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>Hadoop &amp; MapReduce explained with acyclic data flow using stable storage.</li>
<li>Strength: fault-tolerance via disk storage.</li>
<li>Weakness: inefficiency with iterative or interactive workloads (e.g. ML, graph analysis).</li>
<li>Need for in-memory computation system like Spark.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcae4a04" class="outline-3">
<h3 id="orgcae4a04"><span class="section-number-3">9.4.</span> Iteration in Map Reduce</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>Machine learning models need repeated computation.</li>
<li>Hadoop repeatedly reads/writes from disk, causing inefficiency.</li>
<li>Highlights the need for in-memory operations.</li>
</ul>
</div>
</div>

<div id="outline-container-org0aec3fb" class="outline-3">
<h3 id="org0aec3fb"><span class="section-number-3">9.5.</span> Workload Illustration</h3>
<div class="outline-text-3" id="text-9-5">
<ul class="org-ul">
<li>Iterative workloads: same computation on same data (e.g., model training).</li>
<li>Interactive workloads: varying computations on evolving data (e.g., data exploration).</li>
<li>Key: keep working sets in memory for speed.</li>
</ul>
</div>
</div>

<div id="outline-container-org1250ef7" class="outline-3">
<h3 id="org1250ef7"><span class="section-number-3">9.6.</span> Challenge</h3>
<div class="outline-text-3" id="text-9-6">
<ul class="org-ul">
<li>Challenge: memory is not fault-tolerant.</li>
<li>Existing storage abstractions rely on fine-grained updates, which are expensive to track.</li>
<li>Need for a better balance between efficiency and fault tolerance.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf205d96" class="outline-3">
<h3 id="orgf205d96"><span class="section-number-3">9.7.</span> Solution  RDDs</h3>
<div class="outline-text-3" id="text-9-7">
<ul class="org-ul">
<li>Spark uses RDDs to balance fault-tolerance and efficiency.</li>
<li>RDDs support coarse-grained transformations (e.g., map, group-by, join).</li>
<li>Lineage tracking enables fault recovery without excessive replication.</li>
</ul>
</div>
</div>

<div id="outline-container-orge0c62c2" class="outline-3">
<h3 id="orge0c62c2"><span class="section-number-3">9.8.</span> RDD Recovery</h3>
<div class="outline-text-3" id="text-9-8">
<ul class="org-ul">
<li>Recovery through recomputation based on lineage.</li>
<li>Interactive: rerun only failed iterations.</li>
<li>Iterative: reload or recompute chunks from previous iterations.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc185e54" class="outline-3">
<h3 id="orgc185e54"><span class="section-number-3">9.9.</span> Spark Stack</h3>
<div class="outline-text-3" id="text-9-9">
<ul class="org-ul">
<li>Core: scheduling, memory management, fault recovery.</li>
<li>APIs: Spark SQL, Streaming, MLib (ML), GraphX.</li>
<li>Compatible with YARN, Mesos, or standalone.</li>
</ul>
</div>
</div>

<div id="outline-container-org4366103" class="outline-3">
<h3 id="org4366103"><span class="section-number-3">9.10.</span> Spark Programming Interface</h3>
<div class="outline-text-3" id="text-9-10">
<ul class="org-ul">
<li>Interfaces: Scala, Python, Java.</li>
<li>RDD operations: transformations and actions.</li>
<li>Support for shared variables (broadcast, accumulator).</li>
</ul>
</div>
</div>

<div id="outline-container-org2c4a9c2" class="outline-3">
<h3 id="org2c4a9c2"><span class="section-number-3">9.11.</span> RDD Transformations</h3>
<div class="outline-text-3" id="text-9-11">
<ul class="org-ul">
<li>Examples: map vs flatMap, distinct, union, intersection, subtract.</li>
<li>flatMap flattens nested lists from map.</li>
<li>Intersection and subtract are more costly due to set operations.</li>
</ul>
</div>
</div>

<div id="outline-container-org5782b85" class="outline-3">
<h3 id="org5782b85"><span class="section-number-3">9.12.</span> RDD Transformations Quiz Question</h3>
<div class="outline-text-3" id="text-9-12">
<ul class="org-ul">
<li>Quiz: Apply map and filter on input RDD to understand transformation output.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc7a4d38" class="outline-3">
<h3 id="orgc7a4d38"><span class="section-number-3">9.13.</span> RDD Transformations Quiz Solution</h3>
<div class="outline-text-3" id="text-9-13">
<ul class="org-ul">
<li>Map squares each number: [1, 4, 9, 16].</li>
<li>Filter excludes ‘1’: resulting in [2, 3, 4].</li>
</ul>
</div>
</div>

<div id="outline-container-org1285c3e" class="outline-3">
<h3 id="org1285c3e"><span class="section-number-3">9.14.</span> Spark Operations</h3>
<div class="outline-text-3" id="text-9-14">
<ul class="org-ul">
<li>Transformations: map, filter, groupByKey, etc.</li>
<li>Actions: reduce, collect, count, etc.</li>
<li>Broader set than Hadoop MapReduce.</li>
</ul>
</div>
</div>
