cse_6250_bd4h/index.html

<div id="outline-container-org382f04c" class="outline-3">
<h3 id="org382f04c"><span class="section-number-3">9.15.</span> Shared Variable</h3>
<div class="outline-text-3" id="text-9-15">
<ul class="org-ul">
<li>Broadcast variables: efficient read-only shared data.</li>
<li>Example Spark job with clinical notes:
<ul class="org-ul">
<li>Load data → filter → split → cache.</li>
<li>Perform actions like counting specific symptoms (e.g., fever, cough).</li>
<li>Benefits from caching and distributed execution.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4ab58ee" class="outline-3">
<h3 id="org4ab58ee"><span class="section-number-3">9.16.</span> Fault Tolerance</h3>
<div class="outline-text-3" id="text-9-16">
<ul class="org-ul">
<li>RDD tracks transformations (lineage).</li>
<li>Lost partitions can be recomputed using lineage.</li>
<li>Visuals: sequence of filters and maps reconstruct lost data.</li>
</ul>
</div>
</div>

<div id="outline-container-org9bd8456" class="outline-3">
<h3 id="org9bd8456"><span class="section-number-3">9.17.</span> Example  Logistic Regression</h3>
<div class="outline-text-3" id="text-9-17">
<ul class="org-ul">
<li>Spark efficiently supports logistic regression via iteration.</li>
<li>Data cached in memory → quick updates.</li>
<li>Uses map + reduce to compute gradient.</li>
<li>Comparison: Spark (6s/iter) vs Hadoop (127s/iter).</li>
</ul>
</div>
</div>

<div id="outline-container-org88ba6d5" class="outline-3">
<h3 id="org88ba6d5"><span class="section-number-3">9.18.</span> Example  Disease Risk Prediction</h3>
<div class="outline-text-3" id="text-9-18">
<ul class="org-ul">
<li>Predict patient disease risks using collaborative filtering.</li>
<li>Matrix R = patient × disease.</li>
<li>ALS algorithm: alternates updating patient and disease features.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb38387d" class="outline-3">
<h3 id="orgb38387d"><span class="section-number-3">9.19.</span> Serial ALS</h3>
<div class="outline-text-3" id="text-9-19">
<ul class="org-ul">
<li>Serial implementation of ALS.</li>
<li>Iterative updates of A (patient) and B (disease) matrices.</li>
<li>Uses map functions over patient/disease ranges.</li>
</ul>
</div>
</div>

<div id="outline-container-org03c667b" class="outline-3">
<h3 id="org03c667b"><span class="section-number-3">9.20.</span> Naive Spark ALS</h3>
<div class="outline-text-3" id="text-9-20">
<ul class="org-ul">
<li>Parallel ALS using `spark.parallelize`.</li>
<li>Broadcast used for efficient data sharing.</li>
<li>Broadcast improves performance 3× over naive version.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf308ff8" class="outline-2">
<h2 id="orgf308ff8"><span class="section-number-2">10.</span> Medical Ontology</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org6767589" class="outline-3">
<h3 id="org6767589"><span class="section-number-3">10.1.</span> Introduction to Medical Ontology</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>Healthcare benefits from structured medical knowledge.</li>
<li>Ontologies and knowledge graphs are common in this domain.</li>
<li>Historically, healthcare has developed ontologies for:
<ul class="org-ul">
<li>Diseases</li>
<li>Medical procedures</li>
<li>Medications</li>
<li>Lab tests</li>
</ul></li>
<li>Ontologies aid understanding of healthcare data and validate data models.</li>
<li>The lesson discusses various ontologies and their role in analytics.</li>
</ul>
</div>
</div>

<div id="outline-container-org10830be" class="outline-3">
<h3 id="org10830be"><span class="section-number-3">10.2.</span> Health Data Standards</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>Overview of major health data standards:
<ul class="org-ul">
<li>LOINC: Lab test codes</li>
<li>ICD: Diagnostic codes</li>
<li>CPT: Procedure codes</li>
<li>NDC: Medication codes</li>
</ul></li>
<li>SNOMED: A comprehensive ontology integrating all the above.</li>
<li>UMLS: Software system that accesses integrated medical knowledge.</li>
<li>Use case: Patient encounter example illustrating all standard usages.</li>
<li>Importance:
<ul class="org-ul">
<li>Insurance claim processing</li>
<li>Research and data analysis</li>
</ul></li>
<li>Preview of upcoming detailed discussions on individual standards.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbdf5a44" class="outline-3">
<h3 id="orgbdf5a44"><span class="section-number-3">10.3.</span> ICD</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>ICD = International Classification of Diseases.</li>
<li>Developed by WHO, categorizes diseases.</li>
<li>ICD-9: 17,000+ codes; 3-5 digits; includes main and supplementary categories (e.g., E, V codes).</li>
<li>ICD-10: 141,000+ codes; 7-character alphanumeric structure.</li>
<li>Detailed coding for category, etiology, body part, severity, and extension.</li>
<li>Examples:
<ul class="org-ul">
<li>ICD-9: 250.01 = Type 1 diabetes, no complications</li>
<li>ICD-10: M1A.31X2 = Chronic gout with renal impairment in left shoulder, no tophus</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga1cd6c5" class="outline-3">
<h3 id="orga1cd6c5"><span class="section-number-3">10.4.</span> ICD 9 to ICD 10 Mapping</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>Mapping is mostly one-to-many due to ICD-10's higher specificity.</li>
<li>Some mappings are one-to-one (e.g., Tietze's Syndrome).</li>
<li>Complicated mappings: e.g., ICD-9 code maps to 2,530 ICD-10 codes.</li>
<li>Complexity highlights the increased detail of ICD-10.</li>
</ul>
</div>
</div>

<div id="outline-container-org18841f2" class="outline-3">
<h3 id="org18841f2"><span class="section-number-3">10.5.</span> ICD 9 Quiz Question</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li>Identifies valid and invalid ICD-9 codes.</li>
</ul>
</div>
</div>

<div id="outline-container-orge9b5185" class="outline-3">
<h3 id="orge9b5185"><span class="section-number-3">10.6.</span> ICD 9 Quiz Solution</h3>
<div class="outline-text-3" id="text-10-6">
<ul class="org-ul">
<li>Valid: 501, 802.3, V70, E820.0</li>
<li>Invalid: U80.1, 5A0.01</li>
</ul>
</div>
</div>

<div id="outline-container-org26cb049" class="outline-3">
<h3 id="org26cb049"><span class="section-number-3">10.7.</span> ICD Code Quiz Question</h3>
<div class="outline-text-3" id="text-10-7">
<ul class="org-ul">
<li>Task: Find ICD-9 and ICD-10 codes for Influenza.</li>
</ul>
</div>
</div>

<div id="outline-container-org5715647" class="outline-3">
<h3 id="org5715647"><span class="section-number-3">10.8.</span> ICD Code Quiz Solution</h3>
<div class="outline-text-3" id="text-10-8">
<ul class="org-ul">
<li>ICD-9: 487.1</li>
<li>ICD-10: J11.1</li>
</ul>
</div>
</div>

<div id="outline-container-org45056e9" class="outline-3">
<h3 id="org45056e9"><span class="section-number-3">10.9.</span> CPT</h3>
<div class="outline-text-3" id="text-10-9">
<ul class="org-ul">
<li>CPT = Current Procedural Terminology (US standard).</li>
<li>Used for medical, surgical, diagnostic procedures.</li>
<li>Maintained by the AMA.</li>
<li>Key in insurance reimbursement.</li>
<li>Categories:
<ul class="org-ul">
<li>Category 1: Common procedures (e.g., surgery, radiology)</li>
<li>Category 2: Quality metrics</li>
<li>Category 3: Experimental procedures (e.g., codes ending in T)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org517c583" class="outline-3">
<h3 id="org517c583"><span class="section-number-3">10.10.</span> CPT Code Quiz Question</h3>
<div class="outline-text-3" id="text-10-10">
<ul class="org-ul">
<li>Task: Find CPT code for detailed office visit.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5f34c0" class="outline-3">
<h3 id="orgb5f34c0"><span class="section-number-3">10.11.</span> CPT Code Quiz Solution</h3>
<div class="outline-text-3" id="text-10-11">
<ul class="org-ul">
<li>Office visit range: 99201–99205</li>
<li>Time-based codes (e.g., 99201 = 10 mins, 99205 = 1 hour)</li>
</ul>
</div>
</div>

<div id="outline-container-org09e81eb" class="outline-3">
<h3 id="org09e81eb"><span class="section-number-3">10.12.</span> LOINC</h3>
<div class="outline-text-3" id="text-10-12">
<ul class="org-ul">
<li>LOINC = Logical Observation Identifiers Names and Codes.</li>
<li>Created by Regenstrief Institute.</li>
<li>Standard for lab tests and clinical observations.</li>
<li>Example: 2865-4 = a specific lab test</li>
<li>Attributes:
<ul class="org-ul">
<li>Component</li>
<li>Property</li>
<li>Time aspect (e.g., Pt = point in time)</li>
<li>Sample type</li>
<li>Scale (quantitative, ordinal, etc.)</li>
<li>Method</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf2b265d" class="outline-3">
<h3 id="orgf2b265d"><span class="section-number-3">10.13.</span> LOINC Code Quiz Question</h3>
<div class="outline-text-3" id="text-10-13">
<ul class="org-ul">
<li>Task: Find LOINC code for Creatinine lab test.</li>
</ul>
</div>
</div>

<div id="outline-container-org0e65069" class="outline-3">
<h3 id="org0e65069"><span class="section-number-3">10.14.</span> LOINC Code Quiz Solution</h3>
<div class="outline-text-3" id="text-10-14">
<ul class="org-ul">
<li>Answer: 2160-0</li>
</ul>
</div>
</div>

<div id="outline-container-org359b111" class="outline-3">
<h3 id="org359b111"><span class="section-number-3">10.15.</span> NDC</h3>
<div class="outline-text-3" id="text-10-15">
<ul class="org-ul">
<li>NDC = National Drug Code (for medications).</li>
<li>Maintained by the FDA.</li>
<li>Structure: 3 segments
<ul class="org-ul">
<li>Labeler code (company)</li>
<li>Product code (drug type)</li>
<li>Package code (package details)</li>
</ul></li>
<li>Different digit combinations exist but total is 10 digits.</li>
</ul>
</div>
</div>

<div id="outline-container-org275d45d" class="outline-3">
<h3 id="org275d45d"><span class="section-number-3">10.16.</span> NDC Code Quiz Question</h3>
<div class="outline-text-3" id="text-10-16">
<ul class="org-ul">
<li>Task: Find NDC code for metformin hydrochloride, 500mg.</li>
</ul>
</div>
</div>

<div id="outline-container-org76ec4ac" class="outline-3">
<h3 id="org76ec4ac"><span class="section-number-3">10.17.</span> NDC Code Quiz Solution</h3>
<div class="outline-text-3" id="text-10-17">
<ul class="org-ul">
<li>Example code: 0093-7214-01 (labeler-dependent)</li>
</ul>
</div>
</div>

<div id="outline-container-org79096a7" class="outline-3">
<h3 id="org79096a7"><span class="section-number-3">10.18.</span> SNOMED</h3>
<div class="outline-text-3" id="text-10-18">
<ul class="org-ul">
<li>SNOMED = Systematized Nomenclature of Medicine.</li>
<li>Maintained by IHTSDO (Denmark).</li>
<li>Supports clinical documentation and semantic interoperability.</li>
<li>National editions and implementation subsets exist.</li>
<li>Broad user base: clinicians, researchers, analysts.</li>
</ul>
</div>
</div>
