cse_6250_bd4h/index.html

<div id="outline-container-orgc142776" class="outline-3">
<h3 id="orgc142776"><span class="section-number-3">10.19.</span> Logical Model of SNOMED CT</h3>
<div class="outline-text-3" id="text-10-19">
<ul class="org-ul">
<li>Core components:
<ul class="org-ul">
<li>Concepts (with unique ID)</li>
<li>Descriptions (FSN and synonyms)</li>
<li>Relationships (e.g., “is a”, attributes)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org313882d" class="outline-3">
<h3 id="org313882d"><span class="section-number-3">10.20.</span> SNOMED Example</h3>
<div class="outline-text-3" id="text-10-20">
<ul class="org-ul">
<li>Example concept: 22298006 = Myocardial infarction disorder</li>
<li>Multiple descriptions including synonyms</li>
<li>Preferred vs. acceptable terms are defined by reference sets.</li>
</ul>
</div>
</div>

<div id="outline-container-org095bae4" class="outline-3">
<h3 id="org095bae4"><span class="section-number-3">10.21.</span> SNOMED Relationships</h3>
<div class="outline-text-3" id="text-10-21">
<ul class="org-ul">
<li>“Is a” relationship creates concept hierarchies.</li>
<li>Example: Cellulitis of foot “is a” cellulitis, and “is a” disorder of foot.</li>
<li>Relationships are directional and acyclic.</li>
</ul>
</div>
</div>

<div id="outline-container-org65fd78d" class="outline-3">
<h3 id="org65fd78d"><span class="section-number-3">10.22.</span> SNOMED Design</h3>
<div class="outline-text-3" id="text-10-22">
<ul class="org-ul">
<li>19-level hierarchy of concepts.</li>
<li>Concepts range from general to highly specific.</li>
<li>Relationships include “is a” and others with attributes.</li>
<li>Each concept has a unique ID and descriptions.</li>
</ul>
</div>
</div>

<div id="outline-container-org236643e" class="outline-3">
<h3 id="org236643e"><span class="section-number-3">10.23.</span> SNOMED Code Quiz Question</h3>
<div class="outline-text-3" id="text-10-23">
<ul class="org-ul">
<li>Task: Find SNOMED code for chronic gouty arthritis.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc343de9" class="outline-3">
<h3 id="orgc343de9"><span class="section-number-3">10.24.</span> SNOMED Code Quiz Solution</h3>
<div class="outline-text-3" id="text-10-24">
<ul class="org-ul">
<li>Answer: 68451005</li>
</ul>
</div>
</div>

<div id="outline-container-org90f70eb" class="outline-3">
<h3 id="org90f70eb"><span class="section-number-3">10.25.</span> SNOMED Quiz Question</h3>
<div class="outline-text-3" id="text-10-25">
<ul class="org-ul">
<li>Question: What is the structure of "is a" relationships in SNOMED?</li>
</ul>
</div>
</div>

<div id="outline-container-orge5149a1" class="outline-3">
<h3 id="orge5149a1"><span class="section-number-3">10.26.</span> SNOMED Quiz Solution</h3>
<div class="outline-text-3" id="text-10-26">
<ul class="org-ul">
<li>Answer: Directed acyclic graph (not a tree).</li>
</ul>
</div>
</div>

<div id="outline-container-org5a5300e" class="outline-3">
<h3 id="org5a5300e"><span class="section-number-3">10.27.</span> UMLS</h3>
<div class="outline-text-3" id="text-10-27">
<ul class="org-ul">
<li>UMLS = Unified Medical Language System.</li>
<li>Maintained by US National Library of Medicine.</li>
<li>Integrates multiple standards into a unified system.</li>
<li>Components:
<ul class="org-ul">
<li>Metathesaurus</li>
<li>Semantic network</li>
<li>Specialist lexicon and tools</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb12b516" class="outline-3">
<h3 id="orgb12b516"><span class="section-number-3">10.28.</span> Metathesaurus Concepts</h3>
<div class="outline-text-3" id="text-10-28">
<ul class="org-ul">
<li>Concept hierarchy:
<ul class="org-ul">
<li>Atom (AUI) → String (SUI) → Term (LUI) → Concept (CUI)</li>
</ul></li>
<li>Multiple ontologies/sources integrated.</li>
</ul>
</div>
</div>

<div id="outline-container-org8a63346" class="outline-3">
<h3 id="org8a63346"><span class="section-number-3">10.29.</span> Semantic Network</h3>
<div class="outline-text-3" id="text-10-29">
<ul class="org-ul">
<li>135+ semantic types (e.g., diseases, drugs)</li>
<li>54+ semantic relationships (e.g., cause, treat)</li>
<li>Organizes concepts and their interrelations.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe3e3af" class="outline-3">
<h3 id="orgfe3e3af"><span class="section-number-3">10.30.</span> Specialist Lexicon</h3>
<div class="outline-text-3" id="text-10-30">
<ul class="org-ul">
<li>Lexicon of 300,000+ biomedical terms.</li>
<li>Includes syntax, morphology, orthography.</li>
<li>Used in NLP tools like MetaMap and MMTx.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org3383461" class="outline-2">
<h2 id="org3383461"><span class="section-number-2">11.</span> Graph Analysis</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org17d40f3" class="outline-3">
<h3 id="org17d40f3"><span class="section-number-3">11.1.</span> Introduction to Graph Analysis</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>Overview of graph analysis and its applications.</li>
<li>Used in search engines, social networks, and healthcare.</li>
<li>Identifies clusters of related entities (webpages, patients, conditions).</li>
<li>Will cover similarity graphs and spectral clustering.</li>
</ul>
</div>
</div>

<div id="outline-container-org540bd8e" class="outline-3">
<h3 id="org540bd8e"><span class="section-number-3">11.2.</span> Agenda</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Two main graph-based algorithms introduced:
<ul class="org-ul">
<li>PageRank: Ranks nodes in a directed graph based on importance.</li>
<li>Spectral Clustering: A graph partitioning-based clustering algorithm.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8b76b8f" class="outline-3">
<h3 id="org8b76b8f"><span class="section-number-3">11.3.</span> PageRank</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>Developed by Google co-founders for webpage ranking.</li>
<li>Traditional content-based ranking is prone to spam.</li>
<li>PageRank relies on the graph structure (links between pages).</li>
<li>Intuition: More high-quality pages linking to a page → higher rank.</li>
<li>Represent graph using an adjacency matrix:
<ul class="org-ul">
<li>Normalize matrix rows to represent transition probabilities.</li>
<li>PageRank computed using recursion: browsing + teleporting.</li>
<li>Browsing redistributes rank via adjacency matrix; teleporting randomly jumps.</li>
<li>Equation: `q = cAq + (1 - c)e/N`, where `c` is damping factor (e.g., 0.85).</li>
</ul></li>
<li>Next steps: Implement PageRank using big data systems like Hadoop MapReduce.</li>
</ul>
</div>
</div>

<div id="outline-container-org7d0699e" class="outline-3">
<h3 id="org7d0699e"><span class="section-number-3">11.4.</span> MapReduce  PageRank</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>Implementation of PageRank in MapReduce:
<ul class="org-ul">
<li><b><b>Map Phase</b></b>:
<ul class="org-ul">
<li>Emit current page and its PageRank.</li>
<li>Distribute PageRank to each outgoing link equally.</li>
</ul></li>
<li><b><b>Reduce Phase</b></b>:
<ul class="org-ul">
<li>Aggregate partial PageRanks from map phase.</li>
<li>Add teleporting component.</li>
<li>Emit updated PageRank.</li>
</ul></li>
<li>Hadoop shuffles partial sums to reducers.</li>
<li>Iterative process: repeat map-reduce steps to converge.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgda0012c" class="outline-3">
<h3 id="orgda0012c"><span class="section-number-3">11.5.</span> PageRank Quiz Question</h3>
<div class="outline-text-3" id="text-11-5">
<ul class="org-ul">
<li>Quiz: Rank webpages in a directed graph by PageRank (based on structure).</li>
</ul>
</div>
</div>

<div id="outline-container-org4731d49" class="outline-3">
<h3 id="org4731d49"><span class="section-number-3">11.6.</span> PageRank Quiz Solution</h3>
<div class="outline-text-3" id="text-11-6">
<ul class="org-ul">
<li>Highest: YouTube (3 incoming links).</li>
<li>Lowest: Google (no incoming links).</li>
<li>Recursive PageRank shows differences despite similar local structures.</li>
<li>Amazon &gt; Wikipedia &gt; Facebook in mid-tier due to recursion effects.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd751a04" class="outline-3">
<h3 id="orgd751a04"><span class="section-number-3">11.7.</span> Spectral Clustering</h3>
<div class="outline-text-3" id="text-11-7">
<ul class="org-ul">
<li>Spectral Clustering vs Traditional Clustering:
<ul class="org-ul">
<li>Uses similarity graph of patients based on features.</li>
<li>Steps:
<ol class="org-ol">
<li>Construct similarity graph (nodes = patients, edges = similarity).</li>
<li>Convert graph to adjacency matrix.</li>
<li>Compute top-k eigenvectors of the matrix.</li>
<li>Cluster eigenvectors into groups.</li>
</ol></li>
<li>Effective for high-dimensional or noisy data.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org469a04b" class="outline-3">
<h3 id="org469a04b"><span class="section-number-3">11.8.</span> Similarity Graph Construction</h3>
<div class="outline-text-3" id="text-11-8">
<ul class="org-ul">
<li>Several ways to construct similarity graphs:
<ul class="org-ul">
<li>Epsilon-neighborhood.</li>
<li>K-nearest neighbors.</li>
<li>Fully connected with edge weights (e.g., Gaussian kernel).</li>
</ul></li>
<li>Purpose: capture local similarity between patients.</li>
</ul>
</div>
</div>

<div id="outline-container-org43688db" class="outline-3">
<h3 id="org43688db"><span class="section-number-3">11.9.</span> E Neighborhood Graph</h3>
<div class="outline-text-3" id="text-11-9">
<ul class="org-ul">
<li>Connect nodes within ε distance.</li>
<li>No edge if distance &gt; ε.</li>
<li>Defines sparsity based on ε.</li>
</ul>
</div>
</div>

<div id="outline-container-org0f498ed" class="outline-3">
<h3 id="org0f498ed"><span class="section-number-3">11.10.</span> K Nearest Neighbor Graph</h3>
<div class="outline-text-3" id="text-11-10">
<ul class="org-ul">
<li>Each node connects to its k-nearest neighbors (directed).</li>
<li>Results in sparse graphs for small k.</li>
<li>Variants: binary edges vs weighted edges based on distance.</li>
</ul>
</div>
</div>

<div id="outline-container-org58e1cb4" class="outline-3">
<h3 id="org58e1cb4"><span class="section-number-3">11.11.</span> Fully Connected Graph</h3>
<div class="outline-text-3" id="text-11-11">
<ul class="org-ul">
<li>Every node connected to every other.</li>
<li>Edge weights determined by similarity (e.g., Gaussian kernel).</li>
<li>Most dense graph representation.</li>
</ul>
</div>
</div>

<div id="outline-container-org8faa972" class="outline-3">
<h3 id="org8faa972"><span class="section-number-3">11.12.</span> E Neighborhood Graph Quiz Question</h3>
<div class="outline-text-3" id="text-11-12">
<ul class="org-ul">
<li>Quiz: Select best ε value to reflect clustering structure in 2D patient data.</li>
</ul>
</div>
</div>
