cse_6250_bd4h/index.html

<div id="outline-container-orgfd5c68b" class="outline-3">
<h3 id="orgfd5c68b"><span class="section-number-3">11.13.</span> E Neighborhood Graph Quiz Solution</h3>
<div class="outline-text-3" id="text-11-13">
<ul class="org-ul">
<li>Small ε: too many disconnected clusters.</li>
<li>Large ε: single cluster.</li>
<li>Optimal ε (e.g., B or C) reveals natural clusters in data.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb4d1afb" class="outline-3">
<h3 id="orgb4d1afb"><span class="section-number-3">11.14.</span> Spectral Clustering Algorithm</h3>
<div class="outline-text-3" id="text-11-14">
<ul class="org-ul">
<li>Variations exist:
<ul class="org-ul">
<li>Unnormalized vs Normalized Spectral Clustering.</li>
</ul></li>
<li>Example: simplest uses eigenvectors + k-means.</li>
<li>Spectral clustering transforms data to eigenspace where clusters are clearer.</li>
<li>Recommended reading for theoretical underpinnings.</li>
</ul>
</div>
</div>

<div id="outline-container-orgec615dc" class="outline-3">
<h3 id="orgec615dc"><span class="section-number-3">11.15.</span> Big Data Conclusion</h3>
<div class="outline-text-3" id="text-11-15">
<ul class="org-ul">
<li>Wrap-up of the video series.</li>
<li>Presenter: Jimmy Son.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: W</p>
<p class="date">Created: 2025-03-29 Sat 11:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
